       FD ALUMNOS.
       01 REGISTRO-ALUMNOS.
          05 ALUMNO-FECHA-ENTRADA                  PIC X(10).
          05 ALUMNO-NOMAPELL-ENTRADA               PIC X(40).
          05 ALUMNO-MATERIA-ENTRADA                PIC X(30).
          05 ALUMNO-NOTA-ENTRADA                   PIC 9(5)V9(3).
