       FD ERRORES.
       01  REGISTRO-ERRORES.
          05 ERR-FECHA-ENTRADA                  PIC X(10).
          05 ERR-NOMAPELL-ENTRADA               PIC X(40).
          05 ERR-MATERIA-ENTRADA                PIC X(30).
          05 ERR-NOTA-ENTRADA                   PIC 9(5)V9(3).
